In [2]:
# composition

class one:
    def __init__(self, name):
        self.name = name
    def onefun(self):
        print(self.name)
        
class two:
    def __init__(self, age):
        self.age = age
        self.test = one('dhoni')
        self.test.onefun()
    def twofun(self):
        print(self.age)
        
t = two(23)
t.twofun()

dhoni
23

In [4]:
#aggregation
class one:
    def __init__(self, name):
        self.name = name
    def onefun(self):
        print(self.name)
        
class two:
    def __init__(self, age, fobj):
        self.age = age
        self.test = fobj
        fobj.onefun()
    def twofun(self):
        print(self.age)
        
t = two(20, one('Incendero'))
t.twofun()

Incendero
20

In [5]:
# MRO method resolution order
#near by search
class one:
    def fun(self):
        print('Incendero one')
        
class two(one):
    def fun(self):
        print('Incendero two')
        
class three(one):
    def fun(self):
        print('Incendero three')
        
class four(two, three):
    def fun(self):
        print('Incendero four')
        
d = four()
d.fun()

Incendero four

In [7]:
# MRO method resolution order
#near by search
class one:
    def fun(self):
        print('Incendero one')
        
class two(one):
    def fun(self):
        print('Incendero two')
        
class three(one):
    def fun(self):
        print('Incendero three')
        
class four(two, three):
    pass
#     def fun(self):
#         print('Incendero four')
        
d = four()
d.fun()

Incendero two

In [8]:
# MRO method resolution order
#near by search
class one:
    def fun(self):
        print('Incendero one')
        
class two(one):
    def fun(self):
        print('Incendero two')
        
class three(one):
    def fun(self):
        print('Incendero three')
        
class four(three, two):
    pass
#     def fun(self):
#         print('Incendero four')
        
d = four()
d.fun()

Incendero three

In [10]:
# MRO method resolution order
#near by search
class one:
    def fun(self):
        print('Incendero one')
        
class two(one):
    def fun(self):
        print('Incendero two')
        
class three(one):
    pass
#     def fun(self):
#         print('Incendero three')
        
class four(three, two):
    pass
#     def fun(self):
#         print('Incendero four')
        
d = four()
d.fun()

Incendero two

In [12]:
# MRO method resolution order
#near by search
class one:
    def fun(self):
        print('Incendero one')
        
class two(one):
    pass
#     def fun(self):
#         print('Incendero two')
        
class three(one):
    pass
#     def fun(self):
#         print('Incendero three')
        
class four(three, two):
    pass
#     def fun(self):
#         print('Incendero four')
        
d = four()
d.fun()

Incendero one

In [18]:
class ComplexNumber:
    def __init__(self, r=0, i=0):
        self.real = r
        self.imag = i

    def get_data(self):
        print(f'{self.real}+{self.imag}j')
        
num1 = ComplexNumber(2, 3)
num1.get_data()
num2 = ComplexNumber(5)
num2.attr = 10
print((num2.real, num2.imag, num2.attr))
print(num1.attr)

2+3j
(5, 0, 10)

AttributeError: 'ComplexNumber' object has no attribute 'attr'

In [16]:
# Deleting Attributes and Objects
#Any attribute of an object can be deleted anytime, using the del statement. Try the following on the Python shell to see the output.

del num1.imag
num1.get_data()

AttributeError: 'ComplexNumber' object has no attribute 'imag'

In [17]:
del ComplexNumber.get_data
num1.get_data()

AttributeError: 'ComplexNumber' object has no attribute 'get_data'

In [20]:
c1 = ComplexNumber(1,3)
c1.get_data()   
del c1
c1

1+3j

NameError: name 'c1' is not defined

In [21]:
import pandas as pd

df = pd.DataFrame({
    'name' : ['alice', 'bob', 'charlie'],
    'date_of_birth' : ['10/25/2005', '10/29/2002', '01/01/2001']
})

print(df)
print('')

df['date_of_birth'] = pd.to_datetime(df['date_of_birth'])

print(df)

      name date_of_birth
0    alice    10/25/2005
1      bob    10/29/2002
2  charlie    01/01/2001

      name date_of_birth
0    alice    2005-10-25
1      bob    2002-10-29
2  charlie    2001-01-01

In [25]:
df = pd.DataFrame({
    'name' : ['alice', 'bob', 'charlie'],
    'date_of_birth' : ['27/05/2005', '10/02/2002', '01/01/2001']
})

print(df)
print('')

df['date_of_birth'] = pd.to_datetime(df['date_of_birth'], format = '%d/%m/%Y')

print(df)

      name date_of_birth
0    alice    27/05/2005
1      bob    10/02/2002
2  charlie    01/01/2001

      name date_of_birth
0    alice    2005-05-27
1      bob    2002-02-10
2  charlie    2001-01-01

In [29]:
import datetime

df = pd.DataFrame({
    'name' : ['Incendero', 'Alice', 'bob', 'charlie'],
    'age': ['20', '13', '25', '94']
})

df['timestamp_col'] = pd.Timestamp(datetime.datetime.now())

print(df)
print('')

df['formatted_col'] = df['timestamp_col'].map(lambda ts: ts.strftime('%d-%m-%Y'))

print(df)

        name age              timestamp_col
0  Incendero  20 2022-05-16 11:22:45.165875
1      Alice  13 2022-05-16 11:22:45.165875
2        bob  25 2022-05-16 11:22:45.165875
3    charlie  94 2022-05-16 11:22:45.165875

        name age              timestamp_col formatted_col
0  Incendero  20 2022-05-16 11:22:45.165875    16-05-2022
1      Alice  13 2022-05-16 11:22:45.165875    16-05-2022
2        bob  25 2022-05-16 11:22:45.165875    16-05-2022
3    charlie  94 2022-05-16 11:22:45.165875    16-05-2022

In [33]:
import datetime

df = pd.DataFrame({
    'name' : ['Incendero', 'Alice', 'bob', 'charlie'],
    'age': ['20', '13', '25', '94']
})

df['timestamp_col'] = pd.Timestamp(datetime.datetime.now())

print(df)
print('')

fun = lambda ts: ts.strftime('%d-%m-%Y')
df['form_2'] = df['timestamp_col'].map(fun)


df['formatted_col'] = df['timestamp_col'].map(lambda ts: ts.strftime('%d-%m-%Y'))

df

        name age              timestamp_col
0  Incendero  20 2022-05-16 11:30:15.964851
1      Alice  13 2022-05-16 11:30:15.964851
2        bob  25 2022-05-16 11:30:15.964851
3    charlie  94 2022-05-16 11:30:15.964851

        name age              timestamp_col      form_2 formatted_col
0  Incendero  20 2022-05-16 11:30:15.964851  16-05-2022    16-05-2022
1      Alice  13 2022-05-16 11:30:15.964851  16-05-2022    16-05-2022
2        bob  25 2022-05-16 11:30:15.964851  16-05-2022    16-05-2022
3    charlie  94 2022-05-16 11:30:15.964851  16-05-2022    16-05-2022

In [43]:
df

        name age              timestamp_col      form_2 formatted_col
0  Incendero  20 2022-05-16 11:30:15.964851  16-05-2022    16-05-2022
1      Alice  13 2022-05-16 11:30:15.964851  16-05-2022    16-05-2022
2        bob  25 2022-05-16 11:30:15.964851  16-05-2022    16-05-2022
3    charlie  94 2022-05-16 11:30:15.964851  16-05-2022    16-05-2022

In [40]:
import datetime

df[df['timestamp_col'] < pd.Timestamp(datetime.datetime(2022, 5, 17))]

        name age              timestamp_col      form_2 formatted_col
0  Incendero  20 2022-05-16 11:30:15.964851  16-05-2022    16-05-2022
1      Alice  13 2022-05-16 11:30:15.964851  16-05-2022    16-05-2022
2        bob  25 2022-05-16 11:30:15.964851  16-05-2022    16-05-2022
3    charlie  94 2022-05-16 11:30:15.964851  16-05-2022    16-05-2022

In [41]:
import datetime

df[df['timestamp_col'] > pd.Timestamp(datetime.datetime(2022, 5, 17))]

Empty DataFrame
Columns: [name, age, timestamp_col, form_2, formatted_col]
Index: []

In [48]:
import pandas as pd
from datetime import date

df = pd.DataFrame({
    'name': ['alice', 'bob', 'charlie'],
    'date_of_birth': ['10/25/2005', '10/29/2002', '01/01/2002']
})

df['date_of_birth'] = pd.to_datetime(df['date_of_birth'])

output = df[df['date_of_birth']< pd.Timestamp(date(2002,12,5))]
output

      name date_of_birth
1      bob    2002-10-29
2  charlie    2002-01-01

In [46]:
df

      name date_of_birth
0    alice    2005-10-25
1      bob    2002-10-29
2  charlie    2002-01-01

In [50]:
import pandas as pd
from datetime import date

df = pd.DataFrame({
    'name': ['alice', 'bob', 'charlie'],
    'date_of_birth': ['10/25/2005', '10/29/2002', '01/01/2002']
})

df['date_of_birth'] = pd.to_datetime(df['date_of_birth'])

output = df[df['date_of_birth']== pd.Timestamp(date(2002,1,1))]
output

      name date_of_birth
2  charlie    2002-01-01

In [51]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [55]:
table = pd.pivot_table(df, values='D', index=['A', 'B'],
                    columns=['C'], aggfunc=np.sum)
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

In [56]:
table = pd.pivot_table(df, values=['D','E'], index=['A', 'B'],
                    columns=['C'], aggfunc=np.sum)
table

            D           E
C       large small large small
A   B
bar one   4.0   5.0   6.0   8.0
    two   7.0   6.0   9.0   9.0
foo one   4.0   1.0   9.0   2.0
    two   NaN   6.0   NaN  11.0

In [57]:
table = pd.pivot_table(df, values='D', index=['A', 'B'],
                    columns=['C'], aggfunc=np.sum, fill_value=0)
table

C        large  small
A   B
bar one      4      5
    two      7      6
foo one      4      1
    two      0      6

In [58]:
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
                    aggfunc={'D': np.mean,
                             'E': np.mean})
table

                  D         E
A   C
bar large  5.500000  7.500000
    small  5.500000  8.500000
foo large  2.000000  4.500000
    small  2.333333  4.333333

In [59]:
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
                    aggfunc={'D': np.mean,
                             'E': [min, max, np.mean]})
table

                  D    E
               mean  max      mean  min
A   C
bar large  5.500000  9.0  7.500000  6.0
    small  5.500000  9.0  8.500000  8.0
foo large  2.000000  5.0  4.500000  4.0
    small  2.333333  6.0  4.333333  2.0